---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorUtils.CalculateExtrusionData(Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorOptions,System.Collections.Generic.IList{Autodesk.Revit.DB.Face})
source: html/09db98bd-c3ac-7977-7ad5-3c1178f1d633.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorUtils.CalculateExtrusionData Method

## Syntax (C#)
```csharp
public static IList<IFCExtrusionData> CalculateExtrusionData(
	IFCExtrusionCalculatorOptions extrInfo,
	IList<Face> allInputFaces
)
```

## Parameters
- **extrInfo** (`Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorOptions`)
- **allInputFaces** (`System.Collections.Generic.IList < Face >`)